package V_09;
// Задание.  Дан массив nums = [3,2,2,3] и число val = 3. Если в массиве есть числа, равные заданному, 

// нужно перенести эти элементы в конец массива. Таким образом, первые несколько (или все) элементов массива
// должны быть отличны от заданного, а остальные - равны ему.

public class Program {
    public static void main(String[] args) {
        int[] nums = { 3, 4, 8, 3, 2, 0, 4, 5, 7, 2, 3, 4, 5, 0, 2, 7, 4, 5, 3, 7, 4 };
        int val = 3;

    }

    static int numsAr(int[] inputAr) {
        int i = 0;
        int count = 0;
        for (int e : inputAr){
            if (i == 0){
               
            }
        }
    }
}
